export const grades = [
    {
      id: '1',
      name: '7-сынып',
      imageUrl: 'https://moodle1.kubstu.ru/pluginfile.php/171179/course/section/169979/1612650818_121-p-zelenii-fon-dlya-prezentatsii-po-khimii-175.jpg',
      difficulty: 'Easy',
      themes: [
        {
          id: 't1',
          name: 'Заттар қоспалары мен олардың қосылыстарын салыстыру',
          videoUrl: 'https://www.youtube.com/watch?v=ItCfQ8Cr8K8',
          description: 'Заттар қоспалары мен олардың қосылыстарын салыстыру тақырыбында оқушылар заттардың әртүрлі күйде болуын, олардың химиялық және физикалық қасиеттерін үйренеді. Осы сабақта біз заттардың қоспалары мен қосылыстарын салыстырып, олардың айырмашылықтарын талдаймыз. Мысалы, су және оның құрамындағы сутегі мен оттегі туралы түсінік беріледі. Қоспалар мен қосылыстардың анықтамалары, олардың қасиеттері мен қолданылуы талқыланады.',
          quiz: {
            questions: [
              { question: 'Заттар қоспалары мен қосылыстарының айырмашылығын атаңыз.', options: ['А', 'Б'], correctAnswer: 'А' },
            ],
          },
        },
        {
          id: 't2',
          name: 'Заттар және олардың қасиеттері',
          videoUrl: 'https://www.youtube.com/watch?v=dAHa-Et736U',
          description: 'Заттар және олардың қасиеттері тақырыбы бойынша оқушылар заттардың химиялық және физикалық қасиеттерін зерттейді. Осы сабақта біз заттардың тығыздығы, ерігіштігі, қайнау және балқу температурасы сияқты қасиеттерін қарастырамыз. Заттардың әртүрлі физикалық күйде болуы және олардың химиялық реакцияларының нәтижелері туралы білім беріледі.',
          quiz: {
            questions: [
              { question: 'Заттардың тығыздығын қалай анықтауға болады?', options: ['А', 'Б'], correctAnswer: 'А' },
            ],
          },
        },
        {
          id: 't3',
          name: 'Заттың агрегаттық күйлері',
          videoUrl: 'https://www.youtube.com/watch?v=eNnhjh46IPQ',
          description: 'Заттың агрегаттық күйлері тақырыбында оқушылар қатты, сұйық және газ тәрізді заттардың қасиеттерімен танысады. Осы сабақта біз заттардың агрегаттық күйлерінің айырмашылықтарын, олардың физикалық қасиеттерін және өзгеру процестерін қарастырамыз. Заттардың қатты, сұйық және газ тәрізді күйлеріндегі ерекшеліктері мен олардың қолдану салалары түсіндіріледі.',
          quiz: {
            questions: [
              { question: 'Заттың агрегаттық күйлері қандай?', options: ['Қатты, сұйық, газ', 'Тек сұйық'], correctAnswer: 'Қатты, сұйық, газ' },
            ],
          },
        },
      ],
    },
    {
      id: '2',
      name: '8-сынып',
      imageUrl: 'https://yandex-images.clstorage.net/9Ovp9w336/ed42d5GpS/gTCqw-RJoWTaIv0EeNTElKk_EKDZcqQuIbHJwkDEQv8KbHdjFbezer7Kr1gBi9CKY5fvrfD6JvD1_eqPBcxiK8wt-9aBYLFoyga0IAidyNSdChyQgDucPxz54cJdmd4Hivmux61uXroPN4Y5dMfNjge_g0RUsx6wUaiCX-1NfybVcE4j2FmsOLpqeGRMOLzEBWp4oEnHkEtJrbj_2F2e19o1uqvRklY-Z1uiVahrAVMHn99oPYsKqHlkHhul3dNqObz-39jNrMDi-vgswNzYuNlWYHjdD0jTES2YP8gxQjOutTZbdaqmlsuTRoVwd417b08vYJX7giS1cOKDkekb0iGgirs4YaDYMmqIcAhsoMgZwrwIfYtQz31BGO9M9YZ3tk0y_ykSRm6zH84xEBsVz-e3C2QBV1bUjVCqf02tW07t8BK7eL14mCLqkAw8xPAYdY7IBBUv3NvFjcwvoMUKV0456tvBsioKZ8dOBZw_kceLw2_wIa9eDN2A-kelIctKlYASr_jZoHBeOoigGHCYkN1iBFiBe4Bj7Z2UJzD99msSwb6jqTo2Rp-jvt1sh73fJ4u_pOXzFtQ57O67nZ1DpgE4ek8ABYTQeo4g_HzI1Ej1EphUfcsIq4n1jL9wFeLLUu3Ckz2-uh4PM3rV3F9JS6s7bxi5J2pkqSz-I0nRa3qVUGZDUOkEeHqmpBSwZFRM1X6EtO3zcNN1yYgLRL02JyrpYgO1xqp2o8v2AZif3aPvp7-klasGAD3wvi-1MZPGHTS-m4CtoFDWOoQ4iPyg0JV-TPhpNzCX4TEIL5DJFsMmpbaDxW4qZkufAp1o00W366NnaOV33kzR2G7HXaWD1p1MsrvEIcxUBnY4rHz4mMBpnjTwweNw38nR-L_cfWIz5uXqK9FOPn6fayohLDftNw-7P1zlE5ZQRUiyS0VVg6KRgOKDZE1ItEaCpGj8AOicDXYIePWnTAdNhcDTiA2Y',
      difficulty: 'Medium',
      themes: [
        {
          id: 't4',
          name: 'Заттар қоспалары мен олардың қосылыстарын салыстыру',
          videoUrl: 'https://www.youtube.com/watch?v=mWnxE7F-DaA',
          description: 'Заттар қоспалары мен олардың қосылыстарын салыстыру тақырыбында оқушылар заттардың әртүрлі күйде болуын, олардың химиялық және физикалық қасиеттерін үйренеді. Осы сабақта біз заттардың қоспалары мен қосылыстарын салыстырып, олардың айырмашылықтарын талдаймыз. Мысалы, су және оның құрамындағы сутегі мен оттегі туралы түсінік беріледі. Қоспалар мен қосылыстардың анықтамалары, олардың қасиеттері мен қолданылуы талқыланады.',
          quiz: {
            questions: [
              { question: 'Заттар қоспалары мен қосылыстарының айырмашылығын атаңыз.', options: ['А', 'Б'], correctAnswer: 'А' },
            ],
          },
        },
        {
          id: 't5',
          name: 'Заттар және олардың қасиеттері',
          videoUrl: 'https://www.youtube.com/watch?v=6rfHZFtYaIw',
          description: 'Заттар және олардың қасиеттері тақырыбы бойынша оқушылар заттардың химиялық және физикалық қасиеттерін зерттейді. Осы сабақта біз заттардың тығыздығы, ерігіштігі, қайнау және балқу температурасы сияқты қасиеттерін қарастырамыз. Заттардың әртүрлі физикалық күйде болуы және олардың химиялық реакцияларының нәтижелері туралы білім беріледі.',
          quiz: {
            questions: [
              { question: 'Заттардың тығыздығын қалай анықтауға болады?', options: ['А', 'Б'], correctAnswer: 'А' },
            ],
          },
        },
        {
          id: 't6',
          name: 'Заттың агрегаттық күйлері',
          videoUrl: 'https://www.youtube.com/watch?v=gFuHG1yAdp0',
          description: 'Заттың агрегаттық күйлері тақырыбында оқушылар қатты, сұйық және газ тәрізді заттардың қасиеттерімен танысады. Осы сабақта біз заттардың агрегаттық күйлерінің айырмашылықтарын, олардың физикалық қасиеттерін және өзгеру процестерін қарастырамыз. Заттардың қатты, сұйық және газ тәрізді күйлеріндегі ерекшеліктері мен олардың қолдану салалары түсіндіріледі.',
          quiz: {
            questions: [
              { question: 'Заттың агрегаттық күйлері қандай?', options: ['Қатты, сұйық, газ', 'Тек сұйық'], correctAnswer: 'Қатты, сұйық, газ' },
            ],
          },
        },
      ],
    },
    {
      id: '3',
      name: '9-сынып',
      imageUrl: 'https://avatars.mds.yandex.net/i?id=ff11d94adc36d8ef1ee148c7fb7bce47_l-3752796-images-thumbs&n=13',
      difficulty: 'Hard',
      themes: [
        {
          id: 't7',
          name: 'Заттар қоспалары мен олардың қосылыстарын салыстыру',
          videoUrl: 'https://example.com/video7',
          description: 'Заттар қоспалары мен олардың қосылыстарын салыстыру тақырыбында оқушылар заттардың әртүрлі күйде болуын, олардың химиялық және физикалық қасиеттерін үйренеді. Осы сабақта біз заттардың қоспалары мен қосылыстарын салыстырып, олардың айырмашылықтарын талдаймыз. Мысалы, су және оның құрамындағы сутегі мен оттегі туралы түсінік беріледі. Қоспалар мен қосылыстардың анықтамалары, олардың қасиеттері мен қолданылуы талқыланады.',
          quiz: {
            questions: [
              { question: 'Заттар қоспалары мен қосылыстарының айырмашылығын атаңыз.', options: ['А', 'Б'], correctAnswer: 'А' },
            ],
          },
        },
        {
          id: 't8',
          name: 'Заттар және олардың қасиеттері',
          videoUrl: 'https://example.com/video8',
          description: 'Заттар және олардың қасиеттері тақырыбы бойынша оқушылар заттардың химиялық және физикалық қасиеттерін зерттейді. Осы сабақта біз заттардың тығыздығы, ерігіштігі, қайнау және балқу температурасы сияқты қасиеттерін қарастырамыз. Заттардың әртүрлі физикалық күйде болуы және олардың химиялық реакцияларының нәтижелері туралы білім беріледі.',
          quiz: {
            questions: [
              { question: 'Заттардың тығыздығын қалай анықтауға болады?', options: ['А', 'Б'], correctAnswer: 'А' },
            ],
          },
        },
        {
          id: 't9',
          name: 'Заттың агрегаттық күйлері',
          videoUrl: 'https://example.com/video9',
          description: 'Заттың агрегаттық күйлері тақырыбында оқушылар қатты, сұйық және газ тәрізді заттардың қасиеттерімен танысады. Осы сабақта біз заттардың агрегаттық күйлерінің айырмашылықтарын, олардың физикалық қасиеттерін және өзгеру процестерін қарастырамыз. Заттардың қатты, сұйық және газ тәрізді күйлеріндегі ерекшеліктері мен олардың қолдану салалары түсіндіріледі.',
          quiz: {
            questions: [
              { question: 'Заттың агрегаттық күйлері қандай?', options: ['Қатты, сұйық, газ', 'Тек сұйық'], correctAnswer: 'Қатты, сұйық, газ' },
            ],
          },
        },
      ],
    },
    {
        id: '10',
        name: '10-сынып',
        imageUrl: 'https://dereksiz.org/rami-men-asietine-tolindi-orister-eseri-02-00-04--fizikali-him/185352_html_m62a0a5fa.png',
        difficulty: 'Very Hard',
        themes: [
          {
            id: 't10',
            name: 'Химиялық байланыстар',
            videoUrl: 'https://www.youtube.com/watch?v=PomzrbZFm_Q',
            description: 'Химиялық байланыстар тақырыбында оқушылар атомдар арасындағы химиялық байланыстардың түрлерін және олардың қасиеттерін үйренеді. Бұл сабақта иондық, коваленттік және металдық байланыстардың ерекшеліктері талқыланады. Оқушылар әртүрлі заттардың құрылымдарын түсініп, олардың физикалық және химиялық қасиеттерін зерттейді.',
            quiz: {
              questions: [
                { question: 'Химиялық байланыстардың түрлерін атаңыз.', options: ['Иондық', 'Коваленттік', 'Металдық'], correctAnswer: 'Иондық' },
              ],
            },
          },
          {
            id: 't11',
            name: 'Термохимия',
            videoUrl: 'https://www.youtube.com/watch?v=__yIOiGuuk0',
            description: 'Термохимия тақырыбы бойынша оқушылар химиялық реакциялар кезінде жылу алмасу процесін үйренеді. Сабақта энтальпия, экзотермиялық және эндотермиялық реакциялар сияқты ұғымдар қарастырылады. Оқушылар тәжірибе арқылы реакциялардың жылу эффектілерін анықтайды.',
            quiz: {
              questions: [
                { question: 'Экзотермиялық реакция дегеніміз не?', options: ['Жылу бөліп шығарады', 'Жылу сіңіреді'], correctAnswer: 'Жылу бөліп шығарады' },
              ],
            },
          },
          {
            id: 't12',
            name: 'Химиялық тепе-теңдік',
            videoUrl: 'https://www.youtube.com/watch?v=g1lCjPMxq64',
            description: 'Химиялық тепе-теңдік тақырыбында оқушылар химиялық реакциялардың кері және тура бағыттарын үйренеді. Осы сабақта Ле Шателье принципі мен тепе-теңдік константасы түсіндіріледі. Оқушылар тепе-теңдік күйіне әсер ететін факторларды зерттеп, олардың химиялық реакцияларға әсерін түсінеді.',
            quiz: {
              questions: [
                { question: 'Ле Шателье принципі нені білдіреді?', options: ['Тепе-теңдікке әсер ететін факторларды', 'Жылу эффектісін'], correctAnswer: 'Тепе-теңдікке әсер ететін факторларды' },
              ],
            },
          },
        ],
      },
      {
        id: '11',
        name: '11-сынып',
        imageUrl: 'https://livingstonschool.ru/wp-content/uploads/2023/02/chto-takoe-himiya.jpg',
        difficulty: 'Expert',
        themes: [
          {
            id: 't13',
            name: 'Органикалық химияның негіздері',
            videoUrl: 'https://www.youtube.com/watch?v=b_cpXUpx-Os',
            description: 'Органикалық химияның негіздері тақырыбында оқушылар көмірсутектердің құрылысы мен қасиеттерін үйренеді. Сабақта алкандар, алкендер, алкиндер сияқты органикалық қосылыстардың құрылымы мен реакциялары қарастырылады. Оқушылар органикалық қосылыстардың химиялық қасиеттерін зерттеп, олардың қолдану салаларын түсінеді.',
            quiz: {
              questions: [
                { question: 'Алкандар мен алкендердің айырмашылығы неде?', options: ['Қаныққан және қанықпаған көмірсутектер', 'Жылу эффектілері'], correctAnswer: 'Қаныққан және қанықпаған көмірсутектер' },
              ],
            },
          },
          {
            id: 't14',
            name: 'Полимерлер және олардың қолданылуы',
            videoUrl: 'https://www.youtube.com/watch?v=tjqvFmIQ5Zk',
            description: 'Полимерлер және олардың қолданылуы тақырыбында оқушылар полимерлердің құрылысы, түрлері және қасиеттерін үйренеді. Сабақта полимерлердің синтезі, олардың қолдану салалары мен экологиялық әсерлері қарастырылады. Оқушылар әртүрлі полимерлердің қасиеттерін зерттеп, олардың күнделікті өмірдегі рөлін түсінеді.',
            quiz: {
              questions: [
                { question: 'Полимерлер дегеніміз не?', options: ['Көп молекулалардан тұратын қосылыстар', 'Жылу эффектілері'], correctAnswer: 'Көп молекулалардан тұратын қосылыстар' },
              ],
            },
          },
          {
            id: 't15',
            name: 'Биохимияның негіздері',
            videoUrl: 'https://www.youtube.com/watch?v=fuEdA-mgqWk&list=PLL76J_bHixKS2olbbDJcaLoTLgMMqomdB',
            description: 'Биохимияның негіздері тақырыбында оқушылар биологиялық молекулалардың химиялық құрылымы мен функцияларын үйренеді. Сабақта белоктар, нуклеин қышқылдары және ферменттер сияқты биомолекулалардың қасиеттері мен реакциялары қарастырылады. Оқушылар биохимиялық процестерді зерттеп, олардың организмдегі рөлі мен маңызын түсінеді.',
            quiz: {
              questions: [
                { question: 'Белоктар дегеніміз не?', options: ['Амминоқышқылдардан тұратын молекулалар', 'Жылу эффектілері'], correctAnswer: 'Амминоқышқылдардан тұратын молекулалар' },
              ],
            },
          },
        ],
      },
  ];

